Revit 2026 API

# ExternalServiceRegistryGetService Method

---

Returns an instance of an object that represents the external service with the given Id.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ExternalService GetService(
	ExternalServiceId serviceId
)
```
```vb
Public Shared Function GetService (
	serviceId As ExternalServiceId
) As ExternalService
```
```cpp
public:
static ExternalService^ GetService(
	ExternalServiceId^ serviceId
)
```
```fsharp
static member GetService :
        serviceId : ExternalServiceId -> ExternalService
```

#### Parameters

serviceId ExternalServiceId
     Id of the service.

#### Return Value

ExternalService The instance of the service or NULL if it cannot be found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The returned instance is either of type SingleServerService or MultiServerService. Users should cast the returned object to one of the classes if they need access to active servers.

#### Reference

ExternalServiceRegistry Class

Autodesk.Revit.DB.ExternalService Namespace